Tekla Open API Reference for Tekla Structures 2025
BaseLinePlacingType Class
 The BaseLinePlacingType class defines a placing type that places the object using the base line placing.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.BaseLinePlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class BaseLinePlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class BaseLinePlacingType
	Inherits PreferredPlacingTypeBase
The BaseLinePlacingType type exposes the following members.
Constructors
Name | Description
BaseLinePlacingType
 Creates a new base line placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace